Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блюда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлюдоГотово</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HTTPServices/Заказы/Ext/Module.bsl
Функция СписокGET(Запрос)
	
	HTTPСервисОтвет = Новый HTTPСервисОтвет(200);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Представление КАК Представление,
		|	ЗаказПокупателя.Стол.Представление КАК СтолПредставление,
		|	ЗаказПокупателя.СтатусЗаказа КАК СтатусЗаказа,
		|	ЗаказПокупателя.КоличествоГостей КАК КоличествоГостей
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СоответствиеОтвет = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл 
		
		СоответствиеЗаказа = Новый Соответствие;
		СоответствиеЗаказа.Вставить("КоличествоГостей", Выборка.КоличествоГостей);
		СоответствиеЗаказа.Вставить("Стол", Выборка.СтолПредставление);
		СоответствиеЗаказа.Вставить("СтатусЗаказа", Строка(Выборка.СтатусЗаказа));
			
		СоответствиеОтвет.Вставить(Выборка.Представление, СоответствиеЗаказа);
		
	КонецЦикла;
	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СоответствиеОтвет);
	ОтветJSON = ЗаписьJSON.Закрыть();
	
	HTTPСервисОтвет.УстановитьТелоИзСтроки(ОтветJSON, КодировкаТекста.UTF8);
	Возврат HTTPСервисОтвет;	

	
КонецФункции

Функция ЗаказGET(Запрос) 
	
	Номер = Запрос.ПараметрыURL["id"];
	
	HTTPСервисОтвет = Новый HTTPСервисОтвет(200);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Представление КАК Представление,
		|	ЗаказПокупателя.Стол.Представление КАК СтолПредставление,
		|	ЗаказПокупателя.СтатусЗаказа КАК СтатусЗаказа,
		|	ЗаказПокупателя.КоличествоГостей КАК КоличествоГостей,
		|	ЗаказПокупателя.Номер КАК Номер
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СоответствиеОтвет = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл 
		
		СоответствиеЗаказа = Новый Соответствие; 
		СоответствиеЗаказа.Вставить("Номер", Выборка.Номер);
		СоответствиеЗаказа.Вставить("КоличествоГостей", Выборка.КоличествоГостей);
		СоответствиеЗаказа.Вставить("Стол", Выборка.СтолПредставление);
		СоответствиеЗаказа.Вставить("СтатусЗаказа", Строка(Выборка.СтатусЗаказа));	
			
		СоответствиеОтвет.Вставить(Выборка.Представление, СоответствиеЗаказа);
		
	КонецЦикла;
	
	Если СоответствиеОтвет.Количество() = 0 Тогда
		
		HTTPСервисОтвет.УстановитьТелоИзСтроки("Заказа с таким номером не существует", КодировкаТекста.UTF8);
		Возврат HTTPСервисОтвет;	
		
	КонецЕсли;
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СоответствиеОтвет);
	ОтветJSON = ЗаписьJSON.Закрыть();
	
	HTTPСервисОтвет.УстановитьТелоИзСтроки(ОтветJSON, КодировкаТекста.UTF8);
	Возврат HTTPСервисОтвет;
КонецФункции


Функция ЗаказDELETE(Запрос) 
	
	HTTPСервисОтвет = Новый HTTPСервисОтвет(200);
	
	Номер = Запрос.ПараметрыURL["id"];
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.Ссылка;
		
	КонецЦикла;
	
	ОбъектЗаказ = Ссылка.ПолучитьОбъект();
	Если ОбъектЗаказ.ПометкаУдаления = Ложь Тогда
		
		ОбъектЗаказ.УстановитьПометкуУдаления(Истина);
	    HTTPСервисОтвет.УстановитьТелоИзСтроки("Успешно", КодировкаТекста.UTF8);				
	Иначе
		
		HTTPСервисОтвет.УстановитьТелоИзСтроки("У данного документа уже существует пометка на удаление", КодировкаТекста.UTF8);		
	КонецЕсли;
	
	Возврат HTTPСервисОтвет;

КонецФункции


Функция СтатусЗаказаGET(Запрос)
	
	Номер = Запрос.ПараметрыURL["id"];
	
	HTTPСервисОтвет = Новый HTTPСервисОтвет(200);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.СтатусЗаказа КАК СтатусЗаказа
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		HTTPСервисОтвет.УстановитьТелоИзСтроки("Заказа с таким номером не существует", КодировкаТекста.UTF8);
		Возврат HTTPСервисОтвет;
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл 
		
		Статус = Выборка.СтатусЗаказа;
		
	КонецЦикла;
	
	
	HTTPСервисОтвет.УстановитьТелоИзСтроки(Статус, КодировкаТекста.UTF8);
	Возврат HTTPСервисОтвет;

КонецФункции


Функция СтатусЗаказаPUT(Запрос)
	
	HTTPСервисОтвет = Новый HTTPСервисОтвет(200);
	
	Номер = Запрос.ПараметрыURL["id"]; 
	СтатусПараметр = Запрос.ПараметрыЗапроса.Получить("status");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.Ссылка;
		
	КонецЦикла;
	
	ОбъектЗаказ = Ссылка.ПолучитьОбъект(); 
	Если Метаданные.Перечисления.СтатусыЗаказов.ЗначенияПеречисления.Найти(СтатусПараметр) = Неопределено Тогда
		
		 HTTPСервисОтвет.УстановитьТелоИзСтроки("Статус ( " + СтатусПараметр + " ) не существует", КодировкаТекста.UTF8);
	
	ИначеЕсли ОбъектЗаказ.ПометкаУдаления = Истина Тогда
		
		HTTPСервисОтвет.УстановитьТелоИзСтроки("У документа ( " + Номер + " ) есть пометка на удаление", КодировкаТекста.UTF8);		
	
	ИначеЕсли ОбъектЗаказ.СтатусЗаказа <> Перечисления.СтатусыЗаказов[СтатусПараметр] Тогда
		
		ОбъектЗаказ.СтатусЗаказа = Перечисления.СтатусыЗаказов[СтатусПараметр]; 
	    HTTPСервисОтвет.УстановитьТелоИзСтроки("Успешно", КодировкаТекста.UTF8);
		ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);  
		
	Иначе
		
		HTTPСервисОтвет.УстановитьТелоИзСтроки("У документа ( " + Номер + " ) уже статус ( " + СтатусПараметр + " )", КодировкаТекста.UTF8);		
	КонецЕсли;
	
	Возврат HTTPСервисОтвет;
	
КонецФункции
